benchmarks/results/wrk.txt
# SPDX-FileCopyrightText: 2026 Alexandre 'kidev' Poumaroux
# SPDX-License-Identifier: Apache-2.0
#
# TechEmpower-style HTTP benchmark of the SynQt web edge (QHttpServer + QSQLITE).
# Load generator: wrk -t4 -c256 -d15s (the industry-standard driver, for cross-framework
# comparison). Routes named as TechEmpower test types. See benchmarks/edge/.
# Host: Arch Linux, x86_64, 32 CPUs. Qt 6.11.1. Date: 2026-09-07.
# Summary (req/s): plaintext 74.3k, json 70.9k, single-query 53.0k, 20-queries
#                  19.8k, 20-updates 14.0k, fortunes 41.6k; avg latency
#                  3.4-18.2ms, tight tails.

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/json"
Running 15s test @ http://127.0.0.1:8480/json
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.60ms   41.07us   5.81ms   93.07%
    Req/Sec    17.84k   188.19    18.33k    67.67%
  1066417 requests in 15.05s, 148.48MB read
Requests/sec: 70879.67
Transfer/sec:      9.87MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/plaintext"
Running 15s test @ http://127.0.0.1:8480/plaintext
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.44ms   82.95us   5.30ms   97.01%
    Req/Sec    18.71k   297.62    22.08k    76.83%
  1116616 requests in 15.03s, 134.18MB read
Requests/sec: 74269.05
Transfer/sec:      8.92MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/db"
Running 15s test @ http://127.0.0.1:8480/db
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.81ms  113.69us   9.36ms   96.25%
    Req/Sec    13.36k   197.16    16.00k    83.00%
  797346 requests in 15.06s, 113.89MB read
Requests/sec: 52951.08
Transfer/sec:      7.56MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/queries?queries=20"
Running 15s test @ http://127.0.0.1:8480/queries?queries=20
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.87ms  483.51us  22.62ms   98.87%
    Req/Sec     4.99k   177.43     6.20k    64.17%
  297867 requests in 15.04s, 214.90MB read
Requests/sec: 19798.53
Transfer/sec:     14.28MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/updates?queries=20"
Running 15s test @ http://127.0.0.1:8480/updates?queries=20
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.20ms  432.28us  35.02ms   98.01%
    Req/Sec     3.53k   313.89     4.04k    53.67%
  210939 requests in 15.06s, 152.20MB read
Requests/sec: 14009.78
Transfer/sec:     10.11MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/fortunes"
Running 15s test @ http://127.0.0.1:8480/fortunes
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.13ms  167.68us  10.27ms   95.09%
    Req/Sec    10.49k   229.50    12.79k    69.67%
  626498 requests in 15.05s, 808.98MB read
Requests/sec: 41633.37
Transfer/sec:     53.76MB