benchmarks/results/wrk.txt
# SPDX-FileCopyrightText: 2026 Alexandre 'kidev' Poumaroux
# SPDX-License-Identifier: Apache-2.0
#
# TechEmpower-style HTTP benchmark of the SynQt web edge (QHttpServer + QSQLITE).
# Load generator: wrk -t4 -c256 -d15s (the industry-standard driver, for cross-framework
# comparison). Routes named as TechEmpower test types. See benchmarks/edge/.
# Host: Arch Linux, x86_64, 32 CPUs. Qt 6.12.0. Date: 2026-09-10.
# Summary (req/s): plaintext 103.6k, json 92.2k, single-query 64.9k,
#                  20-queries 20.7k, 20-updates 14.1k, fortunes 49.4k; avg
#                  latency 2.5-18.0ms, tight tails.

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/json"
Running 15s test @ http://127.0.0.1:8480/json
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.77ms  143.08us   5.91ms   89.45%
    Req/Sec    23.23k   522.26    27.17k    81.00%
  1386778 requests in 15.05s, 193.09MB read
Requests/sec: 92170.45
Transfer/sec: 12.83MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/plaintext"
Running 15s test @ http://127.0.0.1:8480/plaintext
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.46ms  109.81us   5.00ms   95.19%
    Req/Sec    26.09k   496.00    29.37k    88.33%
  1558664 requests in 15.05s, 187.29MB read
Requests/sec: 103553.89
Transfer/sec: 12.44MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/db"
Running 15s test @ http://127.0.0.1:8480/db
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.93ms  149.69us   7.38ms   93.59%
    Req/Sec    16.38k   346.85    20.04k    84.17%
  977849 requests in 15.06s, 139.68MB read
Requests/sec: 64910.26
Transfer/sec: 9.27MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/queries?queries=20"
Running 15s test @ http://127.0.0.1:8480/queries?queries=20
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.32ms  301.30us  22.88ms   85.61%
    Req/Sec     5.21k   162.94     5.73k    78.50%
  311223 requests in 15.05s, 224.57MB read
Requests/sec: 20680.45
Transfer/sec: 14.92MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/updates?queries=20"
Running 15s test @ http://127.0.0.1:8480/updates?queries=20
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.04ms  405.51us  34.55ms   90.18%
    Req/Sec     3.56k   210.03     3.92k    54.83%
  212561 requests in 15.04s, 153.37MB read
Requests/sec: 14134.65
Transfer/sec: 10.20MB

$ wrk -t4 -c256 -d15s "http://127.0.0.1:8480/fortunes"
Running 15s test @ http://127.0.0.1:8480/fortunes
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.16ms  173.85us   8.98ms   95.30%
    Req/Sec    12.46k   332.63    15.21k    77.83%
  743675 requests in 15.04s, 0.94GB read
Requests/sec: 49448.74
Transfer/sec: 63.85MB